[
    {
        "author": "Gerardo Escobar Apess",
        "address": "",
        "quote": "As a home inspector, my attention to detail and standards are very high. Divine Property Maintenance did a fantastic job pressure washing my home! They responded quickly and made sure to hit all the tough to reach spots with care and detail. I would highly recommend!",
        "star": 5
    },
    {
        "author": "Joe Mango",
        "address": "",
        "quote": "Kyler and team did a great job. Showed up on time and finished when they told me they would. Place looks great now.",
        "star": 5
    },
    {
        "author": "Loretta Cicconi",
        "address": "",
        "quote": "Kyler is a gentleman, eager to please even the finicky client. He is a hard worker and fairly priced. I will see you for my next pressure washing. Thank you. Loretta",
        "star": 5
    },
    {
        "author": "Colin Jones",
        "address": "",
        "quote": "We hired DPM to remove the rust from and power wash our sidewalks. I gotta tell you guys, Kyler and team did a fantastic job with the work and charged us a very fair price. We'll be calling them again for future work around our home.",
        "star": 5
    },
    {
        "author": "shirley krieger",
        "address": "",
        "quote": "Kyler, is a hard-working young man who is eager to please. He pays attention to small details and responds quickly to questions or concerns you may have. If you're looking for someone who will do a fantastic power washing job! I highly recommend",
        "star": 5
    },
    {
        "author": "Stuart Mclean",
        "address": "",
        "quote": "Great guy, and a great job! Showed up quickly, gave me a fair quote for the work, and started the job immediately. Power washed our pool deck and driveway. He has the right equipment to do the job quickly and efficiently. Plan to use this company again next year.",
        "star": 5
    },
    {
        "author": "Ned Lundgren",
        "address": "",
        "quote": "Power washed a pool deck and painting it . Price quote was good. They came to do the job when they said they would . They came back the next day to paint the deck when they said they would . The quality of the work was great. Very nice to deal with 2 hard working young men that said what they would do and do it without any BS. Highly recommend these guys",
        "star": 5
    },
    {
        "author": "Jiohanny Pfirman",
        "address": "",
        "quote": "Had Kyler come to power wash my patio and his work exceeded my expectations. He made sure all surrounding areas were also taken care of. All while being prompt and tidy. Highly recommend!",
        "star": 5
    },
    {
        "author": "Trinity Trees of PSL",
        "address": "",
        "quote": "I had an excellent experience with Divine! They arrived on time, were very professional, and did an outstanding job cleaning our office building. Everything looks brand new again. They were careful around the landscaping and made sure no mess was left behind. I’ll definitely be using their services again and recommending them to friends and neighbors!",
        "star": 5
    },
    {
        "author": "Russ Jenniges",
        "address": "",
        "quote": "Had them clean roof and put on special coating to help with the black mold. Kyler was very friendly and helpful. Him and his helper did a good job.",
        "star": 4
    },
    {
        "author": "william cushing",
        "address": "",
        "quote": "What a difference! Kyler did an incredible job on the roof which hasn't been cleaned in years. He was respectful, not only to me but the property, plants (rinsing the many times to protect them), and patio deck. I couldn't recommend anyone more to pressure wash the property. I will always call him first on any projects in future and will highly recommend to friends and neighbors. Thank you again for a fine job! Bill",
        "star": 5
    },
    {
        "author": "Marcos Daniel Flores",
        "address": "",
        "quote": "I totally highly recommend Divine Property Maintenance!!! They came promptly to clean my very dirty tile roof, and within no time I couldn't recognize the brand new color of my roof! They also did the gutters and other surroundings and now my home feels like brand new! Pricing was very fare and this company is highly professional while been very friendly at the same time! I will be calling them again for sure!! Thank you so much, Marcos.",
        "star": 5
    },
    {
        "author": "Matt Clark",
        "address": "",
        "quote": "Did a great job with my fence and driveway, highly recommended to anyone who needs their property clean with pressure washing.",
        "star": 5
    },
    {
        "author": "Debe Stiles",
        "address": "",
        "quote": "Today Kyler & Andrew did a softwash on my barrel tile roof and cleaned the inside and outside of my gutters. He showed me pics of a few hairline cracks on a couple of tiles and a video of the empty gutters. Both are shining like a star now! His communication before, during & after is awesome. He was appreciative and thankful for the opportunity. When you think the days of quality customer service are dead and buried, Kyler reminds you they are not. Will highly recommend Divine to family, friends and my Realtor network. Thanks Kyler & Andrew!!!",
        "star": 5
    },
    {
        "author": "Curt Comber",
        "address": "",
        "quote": "Great job washing the house, sidewalk, driveway and roof. The roof is sparking. Check out the before and after photos.",
        "star": 5
    },
    {
        "author": "S Mangold",
        "address": "",
        "quote": "Just want to give a shout out to Divine Property Maintenance - Kyler Doran! He did a fabulous job power-washing my sidewalk and Lanai. He has his own company and is not some big conglomerate who wants to take advantage! I asked if he could give me a quote and set up a time to meet. He reviewed everything with me so I knew what to expect and was very reasonable with the cost. He was timely, professional, friendly, and did a fabulous job! I highly recommend him if you need this type of work done. Please let him know I referred you if you contact him. I will definitely continue with him moving forward.",
        "star": 5
    },
    {
        "author": "Jennifer P",
        "address": "",
        "quote": "Showed up on time for the quote and job when he said he would! Offered suggestions for the work I wanted completed. Would definitely recommend and hire company again.",
        "star": 5
    },
    {
        "author": "John Roberts",
        "address": "",
        "quote": "We had DPM clear our gutters, pressure wash concrete surfaces, and clean the sides of the house. There had been bagworms on the side of the house since we purchased it — not any more! Everything else came out immaculate as well. I would give a sixth star if I could.",
        "star": 5
    },
    {
        "author": "Richard Cruz",
        "address": "",
        "quote": "He did a fantastic job on my home, I had my home pressure cleaned by him and he left it looking better than when I bought the home new . He is honest with a fair price, I will be using him regularly.",
        "star": 5
    },
    {
        "author": "Cynthia Alexander",
        "address": "",
        "quote": "Devine Property Maintenance was a pleasure dealing. They showed up on time and did an excellent pressure cleaning of our sidewalks. We will definitely call them again.",
        "star": 5
    },
    {
        "author": "Vicki Morrison",
        "address": "",
        "quote": "A+ business ! Friendly nice guys, arrived on time, finished on time. My driveway and side walks look great ! All the black and rust are gone. Such an improvement to curb appeal ! We will definitely use them again !",
        "star": 5
    },
    {
        "author": "Carlos Arellano",
        "address": "",
        "quote": "Huge thank you to Divine Property Maintenance! My driveway looks brand new and coated to keep HOA violations away. worth every dollar.",
        "star": 5
    },
    {
        "author": "Alma S",
        "address": "",
        "quote": "Kyler cleaned my windows today and he did an amazing job! Very thorough, organized and clean. He was not rushed and took his time and made sure they were cleaned properly. Highly highly recommend him!",
        "star": 5
    },
    {
        "author": "Floridian Signs",
        "address": "",
        "quote": "Can't say enough great things about Kyler and his attention to detail. He's always quick to help out when we need it and isn't afraid to go the extra mile! Friendly and professional service, what more can you ask for!",
        "star": 5
    },
    {
        "author": "Barbara Bardsley",
        "address": "",
        "quote": "He was efficient on time and did a great job! Would highly recommend.",
        "star": 5
    },
    {
        "author": "Meier Orthodontics",
        "address": "",
        "quote": "Did an excellent job! Highly recommend for any exterior cleaning needs.",
        "star": 5
    },
    {
        "author": "Gerardo Escobar Apess",
        "address": "",
        "quote": "As a home inspector, my attention to detail and standards are very high. Divine Property Maintenance did a fantastic job pressure washing my home! They responded quickly and made sure to hit all the tough to reach spots with care and detail. I would highly recommend!",
        "star": 5
    },
    {
        "author": "Gotham City",
        "address": "",
        "quote": "Amazing service ! I would recommend to anyone ! Well priced ! Punctual and clean work ! Please look no further.",
        "star": 5
    },
    {
        "author": "Jamie Marceaux",
        "address": "",
        "quote": "Great job! I will use Divine again.",
        "star": 5
    },
    {
        "author": "Billy Chavers",
        "address": "",
        "quote": "Awesome work…very professional and I will use again and you should too!",
        "star": 5
    },
    {
        "author": "John Spurlin",
        "address": "",
        "quote": "Excellent responsiveness, professional and thorough work. Outstanding all around experience.",
        "star": 5
    },
    {
        "author": "Margaret Burns",
        "address": "",
        "quote": "Kyler did an absolutely amazing job. Very professional and friendly. Thank you.",
        "star": 5
    },
    {
        "author": "Thomas Owens",
        "address": "",
        "quote": "Kyler is terrific and extremely professional. He does outstanding work!",
        "star": 5
    },
    {
        "author": "Durkee Properties",
        "address": "",
        "quote": "Excellent job pressure washing our warehouse! Highly recommend due to communication, fair price, and flexibility!",
        "star": 5
    }
]